[
    {
      "title": "A Black Lady Sketch Show (2019– ) - IMDb: 7.6",
      "image": "",
      "description": "A sketch comedy series created by Robin Thede, featuring a core cast of Black women and celebrity guest stars. (TV-MA)"
    },
    {
      "title": "The Carmichael Show (2015–2017) - IMDb: 7.2",
      "image": "",
      "description": "A sitcom inspired by comedian Jerrod Carmichael's life, tackling social issues with humor and heart. (TV-14)"
    },
    {
      "title": "She's Gotta Have It (2017–2019) - IMDb: 6.5",
      "image": "",
      "description": "Spike Lee's series adaptation of his 1986 film, following artist Nola Darling as she navigates love and independence. (TV-MA)"
    },
    {
      "title": "The Breaks (2017) - IMDb: 6.8",
      "image": "",
      "description": "A drama series set in 1990s New York City, exploring the rise of hip-hop music and culture. (TV-MA)"
    },
    {
      "title": "Unsolved: The Murders of Tupac and The Notorious B.I.G. (2018) - IMDb: 7.2",
      "image": "",
      "description": "A true crime series investigating the unsolved murders of Tupac Shakur and The Notorious B.I.G. (TV-MA)"
    },
    {
      "title": "Wu-Tang: An American Saga (2019–2023) - IMDb: 8.0",
      "image": "",
      "description": "A biographical drama about the formation and rise of the Wu-Tang Clan in 1990s New York. (TV-MA)"
    },
    {
      "title": "Sacred Lies (2018–2020) - IMDb: 7.0",
      "image": "",
      "description": "A mystery drama following a young woman with no hands who escapes a cult and becomes a suspect in a murder case. (TV-MA)"
    },
    {
      "title": "David Makes Man (2019–2021) - IMDb: 7.5",
      "image": "",
      "description": "A coming-of-age drama about a 14-year-old prodigy navigating life in a low-income housing project. (TV-14)"
    },
    {
      "title": "First Wives Club (2019– ) - IMDb: 6.0",
      "image": "",
      "description": "A comedy series about three best friends who reunite to navigate life, love, and revenge after divorces. (TV-MA)"
    },
    {
      "title": "Cherish the Day (2020– ) - IMDb: 6.8",
      "image": "",
      "description": "An anthology series exploring the evolution of a romantic relationship over several years, one day at a time. (TV-14)"
    },
    {
      "title": "Tales (2017– ) - IMDb: 6.5",
      "image": "",
      "description": "An anthology series featuring Black actors and creators, with each episode telling a unique story. (TV-MA)"
    },
    {
      "title": "The Bobby Brown Story (2018) - IMDb: 7.0",
      "image": "",
      "description": "A biographical miniseries about R&B singer Bobby Brown's rise to fame, struggles, and personal life. (TV-14)"
    },
    {
      "title": "The New Edition Story (2017) - IMDb: 8.2",
      "image": "",
      "description": "A biographical miniseries about the rise of the iconic R&B group New Edition. (TV-14)"
    },
    {
      "title": "Greenleaf (2016–2020) - IMDb: 7.7",
      "image": "",
      "description": "A drama series about a powerful family running a megachurch, exploring secrets, scandals, and faith. (TV-14)"
    },
    {
      "title": "Saints & Sinners (2016–2021) - IMDb: 6.3",
      "image": "",
      "description": "A drama series set in a Southern Baptist church, filled with scandal, betrayal, and redemption. (TV-14)"
    },
    {
      "title": "Ambitions (2019) - IMDb: 5.9",
      "image": "",
      "description": "A drama series about a powerful family in Atlanta, exploring love, power, and betrayal. (TV-14)"
    },
    {
      "title": "The Oval (2019– ) - IMDb: 5.3",
      "image": "",
      "description": "A political drama about a fictional First Family, filled with secrets, lies, and scandals. (TV-14)"
    },
    {
      "title": "Ruthless (2020– ) - IMDb: 5.5",
      "image": "",
      "description": "A spin-off of The Oval, focusing on a cult and its members in a small Southern town. (TV-MA)"
    },
    {
      "title": "Delilah (2021) - IMDb: 6.0",
      "image": "",
      "description": "A legal drama about a lawyer who leaves her firm to fight for the underprivileged. (TV-14)"
    },
    {
      "title": "Sistas (2019– ) - IMDb: 5.8",
      "image": "",
      "description": "A drama series about a group of single Black women navigating love, careers, and friendships. (TV-14)"
    },
    {
      "title": "Zatima (2022– ) - IMDb: 6.0",
      "image": "",
      "description": "A spin-off of Sistas, focusing on the relationship between Zac and Fatima. (TV-14)"
    },
    {
      "title": "Bruh (2020–2021) - IMDb: 5.8",
      "image": "",
      "description": "A comedy series about four Black men navigating life, love, and friendships in Atlanta. (TV-14)"
    },
    {
      "title": "All the Queen's Men (2021– ) - IMDb: 6.0",
      "image": "",
      "description": "A drama series about a powerful woman running a male exotic nightclub. (TV-MA)"
    },
    {
      "title": "The Reading (2021– ) - IMDb: 6.5",
      "image": "",
      "description": "A drama series about a young woman who discovers she has the ability to read people's thoughts. (TV-14)"
    },
    {
      "title": "Double Cross (2021– ) - IMDb: 6.0",
      "image": "",
      "description": "A crime drama about a detective who goes undercover to infiltrate a dangerous criminal organization. (TV-14)"
    },
    {
      "title": "A House Divided (2021– ) - IMDb: 6.0",
      "image": "",
      "description": "A drama series about a wealthy family torn apart by secrets, lies, and betrayal. (TV-14)"
    },
    {
      "title": "The Black Hamptons (2022– ) - IMDb: 6.0",
      "image": "",
      "description": "A drama series about two wealthy Black families in the Hamptons, filled with secrets and rivalries. (TV-14)"
    },
    {
      "title": "The Rich and the Ruthless (2021– ) - IMDb: 6.0",
      "image": "",
      "description": "A soap opera about the drama and intrigue behind a successful entertainment magazine. (TV-14)"
    },
    {
      "title": "Diarra from Detroit (2023– ) - IMDb: 7.0",
      "image": "",
      "description": "A comedy series about a woman who starts a detective agency after her husband goes missing. (TV-MA)"
    },
    {
      "title": "The Wonder Years (2021– ) - IMDb: 7.2",
      "image": "",
      "description": "A reboot of the classic series, this time following a Black middle-class family in 1960s Alabama. (TV-PG)"
    },
    {
      "title": "Harlem (2021– ) - IMDb: 6.7",
      "image": "",
      "description": "A comedy series about four Black women navigating life, love, and careers in Harlem. (TV-MA)"
    },
    {
      "title": "Grand Crew (2021– ) - IMDb: 6.5",
      "image": "",
      "description": "A comedy about a group of Black friends who bond over wine and life's ups and downs in Los Angeles. (TV-14)"
    },
    {
      "title": "All American (2018– ) - IMDb: 7.7",
      "image": "",
      "description": "A sports drama inspired by the life of NFL player Spencer Paysinger, following a high school football player navigating two worlds. (TV-14)"
    },
    {
      "title": "All American: Homecoming (2022– ) - IMDb: 6.7",
      "image": "",
      "description": "A spin-off of All American, focusing on a young tennis player and a baseball prodigy at an HBCU. (TV-14)"
    },
    {
      "title": "The Proud Family (2001–2005, 2022– ) - IMDb: 7.1",
      "image": "",
      "description": "An animated series about a Black teenager navigating family, friends, and school, with a reboot exploring modern themes. (TV-G)"
    },
    {
      "title": "Family Reunion (2019–2022) - IMDb: 6.5",
      "image": "",
      "description": "A comedy series about a family who moves from Seattle to Georgia to reconnect with their roots. (TV-G)"
    },
    {
      "title": "Woke (2020–2022) - IMDb: 6.7",
      "image": "",
      "description": "A comedy series about a Black cartoonist who gains the ability to see inanimate objects come to life after a police encounter. (TV-MA)"
    },
    {
      "title": "The Upshaws (2021– ) - IMDb: 6.7",
      "image": "",
      "description": "A sitcom about a working-class Black family in Indiana navigating life's challenges with humor and heart. (TV-14)"
    },
    {
      "title": "Colin in Black & White (2021) - IMDb: 7.0",
      "image": "",
      "description": "A biographical drama about Colin Kaepernick's teenage years, exploring his journey to becoming an activist and NFL player. (TV-MA)"
    },
    {
      "title": "The Big Cigar (2023– ) - IMDb: N/A",
      "image": "",
      "description": "A limited series about Black Panther leader Huey P. Newton's escape to Cuba with the help of a Hollywood producer. (TV-MA)"
    },
    {
      "title": "Genius: MLK/X (2024) - IMDb: N/A",
      "image": "",
      "description": "A biographical series exploring the lives and legacies of Martin Luther King Jr. and Malcolm X. (TV-14)"
    },
    {
      "title": "The Best Man: The Final Chapters (2022– ) - IMDb: 7.0",
      "image": "",
      "description": "A limited series continuation of The Best Man film franchise, following the group of friends as they navigate midlife. (TV-MA)"
    },
    {
      "title": "The Ms. Pat Show (2021– ) - IMDb: 7.2",
      "image": "",
      "description": "A comedy series based on comedian Ms. Pat's life, exploring her journey from a troubled past to a successful stand-up career. (TV-MA)"
    },
    {
      "title": "Unprisoned (2023– ) - IMDb: 7.0",
      "image": "",
      "description": "A comedy-drama about a therapist whose life is upended when her father, a former convict, moves in with her. (TV-MA)"
    },
    {
      "title": "Survival of the Thickest (2023– ) - IMDb: 7.1",
      "image": "",
      "description": "A comedy series about a plus-sized Black woman rebuilding her life after a breakup, based on Michelle Buteau's memoir. (TV-MA)"
    },
    {
      "title": "The Crossover (2023– ) - IMDb: 7.5",
      "image": "",
      "description": "A sports drama about twin brothers navigating basketball, family, and adolescence, based on Kwame Alexander's novel. (TV-PG)"
    },
    {
      "title": "Found (2023– ) - IMDb: 7.0",
      "image": "",
      "description": "A drama series about a crisis management team that helps find missing persons, led by a Black woman with a dark past. (TV-14)"
    },
    {
      "title": "I'm a Virgo (2023– ) - IMDb: 7.2",
      "image": "",
      "description": "A surreal comedy series about a 13-foot-tall Black man navigating life in Oakland, created by Boots Riley. (TV-MA)"
    },
    {
      "title": "The Other Black Girl (2023– ) - IMDb: 6.8",
      "image": "",
      "description": "A thriller series about a Black woman working in publishing who uncovers dark secrets when another Black woman joins the team. (TV-MA)"
    },
    {
      "title": "The Spook Who Sat by the Door (2023– ) - IMDb: N/A",
      "image": "",
      "description": "A modern adaptation of the 1973 film, exploring themes of racial inequality and revolution. (TV-MA)"
    },
    {
      "title": "Kindred (2023– ) - IMDb: 7.0",
      "image": "",
      "description": "A sci-fi drama based on Octavia Butler's novel, following a Black woman who time-travels to a 19th-century plantation. (TV-MA)"
    }
  ]