[
    {
      "title": "Sanford and Son (1972–1977) - IMDb: 7.7",
      "image": "",
      "description": "A classic sitcom about a junk dealer and his son navigating life in Watts, Los Angeles, known for its sharp humor and memorable characters. (TV-PG)"
    },
    {
      "title": "Good Times (1974–1979) - IMDb: 7.4",
      "image": "",
      "description": "A groundbreaking sitcom about a Black family living in a Chicago housing project, tackling social issues with humor and heart. (TV-PG)"
    },
    {
      "title": "The Jeffersons (1975–1985) - IMDb: 7.5",
      "image": "",
      "description": "A spin-off of All in the Family, this sitcom follows George and Louise Jefferson as they move on up to the East Side. (TV-PG)"
    },
    {
      "title": "What's Happening!! (1976–1979) - IMDb: 7.2",
      "image": "",
      "description": "A sitcom about three high school friends navigating life in Los Angeles, known for its catchphrases and comedic moments. (TV-PG)"
    },
    {
      "title": "Diff'rent Strokes (1978–1986) - IMDb: 6.7",
      "image": "",
      "description": "A sitcom about two Black brothers from Harlem adopted by a wealthy white businessman, addressing race and class issues. (TV-PG)"
    },
    {
      "title": "The Facts of Life (1979–1988) - IMDb: 6.8",
      "image": "",
      "description": "A spin-off of Diff'rent Strokes, focusing on the girls at a boarding school, with Charlotte Rae and a young Lisa Whelchel. (TV-PG)"
    },
    {
      "title": "Benson (1979–1986) - IMDb: 7.1",
      "image": "",
      "description": "A spin-off of Soap, this sitcom follows Benson DuBois as he rises from household butler to state government official. (TV-PG)"
    },
    {
      "title": "227 (1985–1990) - IMDb: 6.9",
      "image": "",
      "description": "A sitcom about the residents of a Washington, D.C., apartment building, starring Marla Gibbs as the witty Mary Jenkins. (TV-PG)"
    },
    {
      "title": "Amen (1986–1991) - IMDb: 6.8",
      "image": "",
      "description": "A sitcom about a deacon at a Philadelphia church who dreams of becoming a reverend, starring Sherman Hemsley. (TV-PG)"
    },
    {
      "title": "Roc (1991–1994) - IMDb: 7.2",
      "image": "",
      "description": "A sitcom about a Baltimore garbage collector and his family, known for its live episodes and social commentary. (TV-PG)"
    },
    {
      "title": "Hangin' with Mr. Cooper (1992–1997) - IMDb: 6.5",
      "image": "",
      "description": "A sitcom about a former NBA player turned substitute teacher, starring Mark Curry. (TV-G)"
    },
    {
      "title": "The Jamie Foxx Show (1996–2001) - IMDb: 6.7",
      "image": "",
      "description": "A sitcom about an aspiring actor working at his family's hotel in Los Angeles, starring Jamie Foxx. (TV-PG)"
    },
    {
      "title": "Sister, Sister (1994–1999) - IMDb: 6.3",
      "image": "",
      "description": "A sitcom about twin sisters separated at birth who reunite as teenagers, starring Tia and Tamera Mowry. (TV-G)"
    },
    {
      "title": "The Parent 'Hood (1995–1999) - IMDb: 6.4",
      "image": "",
      "description": "A sitcom about a college professor and his family navigating life in New York City, starring Robert Townsend. (TV-G)"
    },
    {
      "title": "Smart Guy (1997–1999) - IMDb: 6.6",
      "image": "",
      "description": "A sitcom about a 10-year-old genius who skips high school and attends college, starring Tahj Mowry. (TV-G)"
    },
    {
      "title": "The Hughleys (1998–2002) - IMDb: 6.4",
      "image": "",
      "description": "A sitcom about a Black family who moves to a predominantly white neighborhood, starring D.L. Hughley. (TV-PG)"
    },
    {
      "title": "The Steve Harvey Show (1996–2002) - IMDb: 6.7",
      "image": "",
      "description": "A sitcom about a former musician turned high school teacher, starring Steve Harvey. (TV-PG)"
    },
    {
      "title": "One on One (2001–2006) - IMDb: 6.5",
      "image": "",
      "description": "A sitcom about a sportscaster who becomes a single father to his teenage daughter, starring Flex Alexander. (TV-PG)"
    },
    {
      "title": "Half & Half (2002–2006) - IMDb: 6.6",
      "image": "",
      "description": "A sitcom about two half-sisters who reconnect as adults and navigate their differences, starring Rachel True and Essence Atkins. (TV-PG)"
    },
    {
      "title": "Girlfriends (2000–2008) - IMDb: 7.3",
      "image": "",
      "description": "A sitcom about four Black women navigating careers, relationships, and friendships in Los Angeles. (TV-14)"
    },
    {
      "title": "The Parkers (1999–2004) - IMDb: 6.4",
      "image": "",
      "description": "A spin-off of Moesha, focusing on mother-daughter duo Nikki and Kim Parker as they attend the same college. (TV-PG)"
    },
    {
      "title": "Moesha (1996–2001) - IMDb: 6.7",
      "image": "",
      "description": "A sitcom about a Black teenager navigating high school, family, and relationships in Los Angeles, starring Brandy. (TV-PG)"
    },
    {
      "title": "Living Single (1993–1998) - IMDb: 7.2",
      "image": "",
      "description": "A sitcom about four single Black women living in a Brooklyn brownstone, starring Queen Latifah and Kim Fields. (TV-PG)"
    },
    {
      "title": "A Different World (1987–1993) - IMDb: 6.8",
      "image": "",
      "description": "A spin-off of The Cosby Show, following students at the fictional HBCU, Hillman College. (TV-PG)"
    },
    {
      "title": "The Cosby Show (1984–1992) - IMDb: 7.3",
      "image": "",
      "description": "A classic sitcom about the Huxtable family, led by Dr. Heathcliff Huxtable, showcasing Black excellence and family values. (TV-G)"
    },
    {
      "title": "In Living Color (1990–1994) - IMDb: 7.5",
      "image": "",
      "description": "A sketch comedy series featuring a predominantly Black cast, launching the careers of Jim Carrey, Jamie Foxx, and more. (TV-14)"
    },
    {
      "title": "The Arsenio Hall Show (1989–1994) - IMDb: 7.0",
      "image": "",
      "description": "A late-night talk show hosted by Arsenio Hall, known for its hip-hop and R&B performances and celebrity interviews. (TV-PG)"
    },
    {
      "title": "Soul Train (1971–2006) - IMDb: 8.0",
      "image": "",
      "description": "A music and dance show showcasing Black artists and culture, hosted by Don Cornelius. (TV-G)"
    },
    {
      "title": "The Flip Wilson Show (1970–1974) - IMDb: 7.2",
      "image": "",
      "description": "A variety show hosted by comedian Flip Wilson, featuring skits, musical performances, and celebrity guests. (TV-G)"
    },
    {
      "title": "Julia (1968–1971) - IMDb: 6.8",
      "image": "",
      "description": "A groundbreaking sitcom about a Black nurse raising her son as a single mother, starring Diahann Carroll. (TV-G)"
    },
    {
      "title": "I Spy (1965–1968) - IMDb: 7.5",
      "image": "",
      "description": "A spy series starring Bill Cosby and Robert Culp, making Cosby the first Black actor to co-star in a dramatic TV series. (TV-PG)"
    },
    {
      "title": "The Nat King Cole Show (1956–1957) - IMDb: 7.8",
      "image": "",
      "description": "A variety show hosted by Nat King Cole, the first of its kind hosted by a Black performer. (TV-G)"
    },
    {
      "title": "Amos 'n' Andy (1951–1953) - IMDb: 6.0",
      "image": "",
      "description": "A controversial sitcom about two Black men navigating life in Harlem, known for its racial stereotypes. (TV-G)"
    },
   
    {
      "title": "The Jack Benny Program (1950–1965) - IMDb: 7.8",
      "image": "",
      "description": "A variety show featuring Eddie Anderson as Rochester, Benny's valet and one of the first recurring Black characters on TV. (TV-G)"
    },
   
    {
      "title": "The Richard Pryor Show (1977) - IMDb: 7.5",
      "image": "",
      "description": "A short-lived variety show hosted by Richard Pryor, known for its bold and controversial humor. (TV-MA)"
    },
    {
      "title": "The Wiz Live! (2015) - IMDb: 7.5",
      "image": "",
      "description": "A live television adaptation of the Broadway musical The Wiz, featuring an all-Black cast. (TV-PG)"
    },
    {
      "title": "The New Bill Cosby Show (1972–1973) - IMDb: 6.5",
      "image": "",
      "description": "A variety show hosted by Bill Cosby, featuring comedy sketches and musical performances. (TV-G)"
    },
    {
      "title": "The Flip Wilson Show (1970–1974) - IMDb: 7.2",
      "image": "",
      "description": "A variety show hosted by comedian Flip Wilson, featuring skits, musical performances, and celebrity guests. (TV-G)"
    },
    {
      "title": "The Sammy Davis Jr. Show (1966) - IMDb: 7.0",
      "image": "",
      "description": "A variety show hosted by Sammy Davis Jr., featuring musical performances and celebrity guests. (TV-G)"
    }
  ]