[{
    "title": "Shaft (1971) - IMDb: 6.5/10",
    "image": "",
    "description": "A blaxploitation classic following private detective John Shaft as he navigates Harlem's criminal underworld to rescue a kidnapping victim. (R)"
  },
  {
    "title": "Boyz n the Hood (1991) - IMDb: 7.8/10",
    "image": "",
    "description": "John Singleton's groundbreaking drama about growing up in South Central Los Angeles, exploring gang violence and systemic racism. (R)"
  },
  {
    "title": "Love & Basketball (2000) - IMDb: 7.2/10",
    "image": "",
    "description": "A romantic drama tracing the relationship between two aspiring basketball players from childhood through adulthood. (PG-13)"
  },
  {
    "title": "Training Day (2001) - IMDb: 7.7/10",
    "image": "",
    "description": "Denzel Washington stars as a corrupt narcotics detective testing a rookie officer during a chaotic 24-hour patrol in LA. (R)"
  },
  {
    "title": "Dreamgirls (2006) - IMDb: 6.5/10",
    "image": "",
    "description": "A musical drama following the rise of a 1960s girl group inspired by The Supremes, featuring powerhouse vocal performances. (PG-13)"
  },
  {
    "title": "The Hate U Give (2018) - IMDb: 7.5/10",
    "image": "",
    "description": "A teenager witnesses the police shooting of her childhood friend, forcing her to confront activism and community tensions. (PG-13)"
  },
  {
    "title": "Us (2019) - IMDb: 6.8/10",
    "image": "",
    "description": "Jordan Peele's horror masterpiece about a family confronted by terrifying doppelgängers, exploring themes of duality and oppression. (R)"
  },
  {
    "title": "Harriet (2019) - IMDb: 6.7/10",
    "image": "",
    "description": "Biopic of Harriet Tubman, chronicling her escape from slavery and heroic work with the Underground Railroad. (PG-13)"
  },
  {
    "title": "Judas and the Black Messiah (2021) - IMDb: 7.4/10",
    "image": "",
    "description": "The true story of Fred Hampton's leadership in the Black Panther Party and the FBI's infiltration efforts. (R)"
  },
  {
    "title": "Friday (1995) - IMDb: 7.3/10",
    "image": "",
    "description": "A stoner comedy following two friends in South Central LA as they navigate neighborhood antics and local bullies. (R)"
  },
  {
    "title": "Menace II Society (1993) - IMDb: 7.6/10",
    "image": "",
    "description": "A gritty portrayal of gang life in Watts, Los Angeles, following a young man's struggle to escape cyclical violence. (R)"
  },
  {
    "title": "The Wiz (1978) - IMDb: 5.3/10",
    "image": "",
    "description": "An urban retelling of The Wizard of Oz featuring an all-Black cast, including Diana Ross and Michael Jackson. (G)"
  },
  {
    "title": "Bamboozled (2000) - IMDb: 6.9/10",
    "image": "",
    "description": "Spike Lee's satirical film about a TV executive who creates a modern minstrel show, critiquing media racism. (R)"
  },
  {
    "title": "Eve's Bayou (1997) - IMDb: 7.3/10",
    "image": "",
    "description": "A Southern Gothic drama about a Creole family's secrets and a young girl's coming-of-age in 1960s Louisiana. (R)"
  },
  {
    "title": "The Tuskegee Airmen (1995) - IMDb: 7.2/10",
    "image": "",
    "description": "Historical drama about the first Black pilots in the U.S. Army Air Forces during WWII. (PG-13)"
  },
  {
    "title": "Crooklyn (1994) - IMDb: 7.5/10",
    "image": "",
    "description": "Spike Lee's semi-autobiographical film about a Brooklyn family's joys and struggles in the 1970s. (PG-13)"
  },
  {
    "title": "What's Love Got to Do with It (1993) - IMDb: 7.3/10",
    "image": "",
    "description": "Biopic of Tina Turner's rise to fame and survival through an abusive marriage to Ike Turner. (R)"
  },
  {
    "title": "Rosewood (1997) - IMDb: 7.1/10",
    "image": "",
    "description": "Based on the 1923 massacre of a Black Florida town, this film examines racial violence and community resilience. (R)"
  },
  {
    "title": "BlacKkKlansman (2018) - IMDb: 7.5/10",
    "image": "",
    "description": "Spike Lee's true-story drama about a Black detective infiltrating the Ku Klux Klan in 1970s Colorado. (R)"
  },
  {
    "title": "Ma Rainey's Black Bottom (2020) - IMDb: 6.9/10",
    "image": "",
    "description": "A tense drama about a 1927 recording session with blues legend Ma Rainey, featuring Chadwick Boseman's final performance. (R)"
  },
  {
    "title": "One Night in Miami (2020) - IMDb: 7.1/10",
    "image": "",
    "description": "A fictionalized account of a 1964 meeting between Malcolm X, Muhammad Ali, Sam Cooke, and Jim Brown. (R)"
  },
  {
    "title": "13th (2016) - IMDb: 8.2/10",
    "image": "",
    "description": "Ava DuVernay's documentary exploring racial inequality and the mass incarceration of African Americans. (TV-MA)"
  },
  {
    "title": "If Beale Street Could Talk (2018) - IMDb: 7.1/10",
    "image": "",
    "description": "Barry Jenkins' romantic drama about a pregnant woman fighting to prove her fiancé's innocence in 1970s Harlem. (R)"
  },
  {
    "title": "Da 5 Bloods (2020) - IMDb: 6.5/10",
    "image": "",
    "description": "Spike Lee's war drama following Black Vietnam veterans returning to find buried treasure and confront their past. (R)"
  },
  {
    "title": "The Harder They Fall (2021) - IMDb: 6.7/10",
    "image": "",
    "description": "A stylish Western featuring an all-Black cast, centered on outlaw Nat Love's quest for revenge. (R)"
  },
  {
    "title": "Sorry to Bother You (2018) - IMDb: 6.9/10",
    "image": "",
    "description": "A surreal satire about a telemarketer who discovers bizarre corporate secrets while climbing the career ladder. (R)"
  },
  {
    "title": "School Daze (1988) - IMDb: 6.5/10",
    "image": "",
    "description": "Spike Lee's musical comedy-drama exploring colorism and social politics at a historically Black college. (R)"
  },
  {
    "title": "Devil in a Blue Dress (1995) - IMDb: 7.0/10",
    "image": "",
    "description": "A neo-noir mystery following Easy Rawlins, a Black WWII vet turned detective in 1940s Los Angeles. (R)"
  },
  {
    "title": "House Party (1990) - IMDb: 6.6/10",
    "image": "",
    "description": "A hip-hop comedy about two friends trying to host the ultimate house party while avoiding trouble. (R)"
  },
  {
    "title": "Waiting to Exhale (1995) - IMDb: 6.6/10",
    "image": "",
    "description": "A drama following four Black women navigating love, careers, and friendships in Phoenix, Arizona. (R)"
  },
  {
    "title": "Bébé's Kids (1992) - IMDb: 5.9/10",
    "image": "",
    "description": "An animated comedy about a man's chaotic date at an amusement park with his girlfriend and her unruly children. (PG-13)"
  },
  {
    "title": "Eyes on the Prize (1987) - IMDb: 9.0/10",
    "image": "",
    "description": "Landmark documentary series chronicling the Civil Rights Movement from 1954 to 1985. (NR)"
  },
  {
    "title": "The Best Man (1999) - IMDb: 6.7/10",
    "image": "",
    "description": "A romantic comedy-drama about college friends reuniting for a wedding while confronting past secrets. (R)"
  },
  {
    "title": "Carmen Jones (1954) - IMDb: 6.8/10",
    "image": "",
    "description": "An all-Black musical adaptation of Carmen set during WWII, starring Dorothy Dandridge and Harry Belafonte. (Approved)"
  },
  {
    "title": "Cooley High (1975) - IMDb: 7.4/10",
    "image": "",
    "description": "A coming-of-age comedy-drama following Chicago teens in the 1960s, inspiring later films like 'Dazed and Confused.' (PG)"
  },
  {
    "title": "Sweet Sweetback's Baadasssss Song (1971) - IMDb: 5.7/10",
    "image": "",
    "description": "A revolutionary blaxploitation film about a Black man on the run from police after defending a civil rights activist. (X)"
  },
  {
    "title": "Super Fly (1972) - IMDb: 6.3/10",
    "image": "",
    "description": "A cocaine dealer tries to make one last big score in this influential blaxploitation film with a iconic Curtis Mayfield soundtrack. (R)"
  },
  {
    "title": "Hollywood Shuffle (1987) - IMDb: 7.1/10",
    "image": "",
    "description": "A satirical comedy about a Black actor struggling with stereotypical roles in Hollywood. (R)"
  },
  {
    "title": "Glory (1989) - IMDb: 7.8/10",
    "image": "",
    "description": "Historical drama about the 54th Massachusetts Infantry Regiment, one of the first Black units in the Civil War. (R)"
  },
  {
    "title": "Akeelah and the Bee (2006) - IMDb: 7.3/10",
    "image": "",
    "description": "An inspirational drama about an 11-year-old girl from South LA competing in the National Spelling Bee. (PG)"
  },
  {
    "title": "Pariah (2011) - IMDb: 7.1/10",
    "image": "",
    "description": "A coming-of-age story about a Black lesbian teenager navigating family expectations and self-discovery. (R)"
  },
  {
    "title": "Dear White People (2014) - IMDb: 6.1/10",
    "image": "",
    "description": "A satirical comedy-drama exploring racial tensions at a predominantly white Ivy League university. (R)"
  },
  {
    "title": "Dope (2015) - IMDb: 7.3/10",
    "image": "",
    "description": "A coming-of-age comedy about a nerdy teen from Inglewood caught up in a drug deal gone wrong. (R)"
  },
  {
    "title": "Mudbound (2017) - IMDb: 7.4/10",
    "image": "",
    "description": "A post-WWII drama about two families—one Black, one white—confronting racism and trauma in rural Mississippi. (R)"
  },
  {
    "title": "Waves (2019) - IMDb: 7.5/10",
    "image": "",
    "description": "A visually stunning drama about a Black family in Florida grappling with love, loss, and forgiveness. (R)"
  },
  {
    "title": "Antebellum (2020) - IMDb: 5.3/10",
    "image": "",
    "description": "A psychological horror film linking modern-day racism to the atrocities of slavery. (R)"
  },
  {
    "title": "Sylvie's Love (2020) - IMDb: 7.0/10",
    "image": "",
    "description": "A 1950s/60s romance between an aspiring TV producer and a saxophonist, set against Harlem's jazz scene. (PG-13)"
  },
  {
    "title": "Concrete Cowboy (2020) - IMDb: 6.9/10",
    "image": "",
    "description": "A drama about Philadelphia's urban Black cowboy subculture, starring Idris Elba. (R)"
  },
  {
    "title": "Summer of Soul (2021) - IMDb: 8.0/10",
    "image": "",
    "description": "Documentary about the 1969 Harlem Cultural Festival, featuring performances by Nina Simone, Stevie Wonder, and more. (PG-13)"
  },
  {
    "title": "King Richard (2021) - IMDb: 7.5/10",
    "image": "",
    "description": "Biopic of Richard Williams, father of Venus and Serena Williams, and his relentless coaching methods. (PG-13)"
  },
  {
    "title": "Respect (2021) - IMDb: 6.6/10",
    "image": "",
    "description": "Aretha Franklin biopic tracing her journey from childhood choir singer to the Queen of Soul. (PG-13)"
  }
]