[
    {
      "title": "Girls Trip (2017) - IMDb: 6.1/10",
      "image": "",
      "description": "A raunchy comedy about four friends reigniting their bond during a wild weekend at the Essence Festival in New Orleans. (R)"
    },
    {
      "title": "Soul (2020) - IMDb: 8.0/10",
      "image": "",
      "description": "Pixar's animated film about a Black jazz musician trapped between Earth and the afterlife, exploring purpose and passion. (PG)"
    },
    {
      "title": "The Photograph (2020) - IMDb: 6.1/10",
      "image": "",
      "description": "A romantic drama intertwining two love stories across generations, centered on a legacy left by a legendary photographer. (PG-13)"
    },
    {
      "title": "They Cloned Tyrone (2023) - IMDb: 6.9/10",
      "image": "",
      "description": "A sci-fi mystery comedy following three characters uncovering a government conspiracy involving neighborhood clones. (R)"
    },
    {
      "title": "The Banker (2020) - IMDb: 7.3/10",
      "image": "",
      "description": "Based on true events, two Black entrepreneurs in the 1960s train a working-class man to pose as the face of their real estate empire. (PG-13)"
    },
    {
      "title": "Marshall (2017) - IMDb: 7.0/10",
      "image": "",
      "description": "A biographical drama about Thurgood Marshall's early career as an NAACP lawyer defending a Black chauffeur accused of rape. (PG-13)"
    },
    {
      "title": "Queen & Slim (2019) - IMDb: 6.9/10",
      "image": "",
      "description": "A Bonnie-and-Clyde-inspired drama about a couple on the run after killing a police officer in self-defense. (R)"
    },
    {
      "title": "Bad Boys (1995) - IMDb: 6.8/10",
      "image": "",
      "description": "Action-comedy starring Will Smith and Martin Lawrence as Miami narcotics detectives protecting a witness from drug lords. (R)"
    },
    {
      "title": "Barbershop (2002) - IMDb: 6.3/10",
      "image": "",
      "description": "A day in the life of a South Side Chicago barbershop, blending comedy and social commentary on community issues. (PG-13)"
    },
    {
      "title": "The Wood (1999) - IMDb: 6.9/10",
      "image": "",
      "description": "A coming-of-age comedy-drama about three friends reminiscing about their 1980s adolescence in Inglewood, California. (R)"
    },
    {
      "title": "Brown Sugar (2002) - IMDb: 6.5/10",
      "image": "",
      "description": "A romantic comedy exploring hip-hop culture through childhood friends turned music executives navigating love and careers. (PG-13)"
    },
    {
      "title": "Think Like a Man (2012) - IMDb: 6.5/10",
      "image": "",
      "description": "A comedy following four men whose relationships are upended when their partners start using Steve Harvey's advice against them. (PG-13)"
    },
    {
      "title": "Jumping the Broom (2011) - IMDb: 5.9/10",
      "image": "",
      "description": "A culture-clash comedy about two families from different socioeconomic backgrounds colliding at a Martha's Vineyard wedding. (PG-13)"
    },
    {
      "title": "Beyond the Lights (2014) - IMDb: 7.0/10",
      "image": "",
      "description": "A romantic drama about a rising pop star and a police officer who help each other escape the pressures of fame and duty. (PG-13)"
    },
    {
      "title": "I Am Not Your Negro (2016) - IMDb: 7.9/10",
      "image": "",
      "description": "A documentary narrated by Samuel L. Jackson, expanding on James Baldwin's unfinished manuscript about race in America. (PG-13)"
    },
    {
      "title": "The Black Power Mixtape 1967-1975 (2011) - IMDb: 7.4/10",
      "image": "",
      "description": "A documentary using Swedish archival footage to chronicle the Black Power movement through interviews with activists. (NR)"
    },
    {
      "title": "Ali (2001) - IMDb: 6.7/10",
      "image": "",
      "description": "Will Smith stars as Muhammad Ali in this biopic covering his boxing career, conversion to Islam, and activism. (R)"
    },
    {
      "title": "Red Tails (2012) - IMDb: 5.9/10",
      "image": "",
      "description": "An action drama about the Tuskegee Airmen, the first Black fighter pilots in WWII, battling racism and Nazis. (PG-13)"
    },
    {
      "title": "The Great Debaters (2007) - IMDb: 7.5/10",
      "image": "",
      "description": "Denzel Washington directs and stars in this true story of a 1930s Black college debate team challenging Harvard. (PG-13)"
    },
    {
      "title": "Remember the Titans (2000) - IMDb: 7.8/10",
      "image": "",
      "description": "A sports drama about the integration of a Virginia high school football team in 1971, led by Coach Herman Boone. (PG)"
    },
    {
      "title": "She's Gotta Have It (1986) - IMDb: 6.7/10",
      "image": "",
      "description": "Spike Lee's debut film about a sexually liberated Black artist navigating relationships with three suitors. (R)"
    },
    {
      "title": "Inside Man (2006) - IMDb: 7.6/10",
      "image": "",
      "description": "A heist thriller about a bank robbery orchestrated by a cunning criminal (Clive Owen) and the detective (Denzel Washington) trying to outsmart him. (R)"
    },
    {
      "title": "Till (2022) - IMDb: 7.2/10",
      "image": "",
      "description": "A biographical drama about Mamie Till-Mobley's fight for justice after her son Emmett Till's lynching in 1955 Mississippi. (PG-13)"
    },
    {
      "title": "The Woman King (2022) - IMDb: 6.8/10",
      "image": "",
      "description": "Historical action epic about the Agojie, an all-female warrior unit protecting the Dahomey Kingdom in 1820s Africa. (PG-13)"
    },
    {
      "title": "Nope (2022) - IMDb: 6.8/10",
      "image": "",
      "description": "Jordan Peele's sci-fi horror film about siblings documenting a UFO terrorizing their California horse ranch. (R)"
    },
    {
      "title": "Atlantics (2019) - IMDb: 6.9/10",
      "image": "",
      "description": "A Senegalese magical realism drama about a woman haunted by her lover lost at sea, blending romance and social critique. (TV-MA)"
    },
    {
      "title": "Rocks (2019) - IMDb: 7.2/10",
      "image": "",
      "description": "A British coming-of-age drama about a teenage girl caring for her brother after their mother abandons them in London. (PG-13)"
    },
    {
      "title": "Spider-Man: Into the Spider-Verse (2018) - IMDb: 8.4/10",
      "image": "",
      "description": "An animated superhero film following Miles Morales, a Black-Latino teen becoming Spider-Man in a multiverse adventure. (PG)"
    },
    {
      "title": "Cinderella (1997) - IMDb: 6.0/10",
      "image": "",
      "description": "A musical adaptation starring Brandy and Whitney Houston, reimagining the fairy tale with a racially diverse cast. (G)"
    },
    {
      "title": "Boomerang (1992) - IMDb: 6.1/10",
      "image": "",
      "description": "A romantic comedy about a cocky ad executive whose womanizing ways backfire when he meets his match. (R)"
    },
    {
      "title": "The Best Man Holiday (2013) - IMDb: 6.5/10",
      "image": "",
      "description": "A sequel reuniting college friends for a Christmas gathering filled with secrets, rivalries, and emotional revelations. (R)"
    },
    {
      "title": "Dolemite Is My Name (2019) - IMDb: 7.2/10",
      "image": "",
      "description": "A biographical comedy about Rudy Ray Moore's creation of his blaxploitation persona Dolemite in 1970s Los Angeles. (R)"
    },
    {
      "title": "See You Yesterday (2019) - IMDb: 6.0/10",
      "image": "",
      "description": "A sci-fi drama about two Brooklyn teens building time machines to prevent a police shooting. (TV-14)"
    },
    {
      "title": "The Forty-Year-Old Version (2020) - IMDb: 7.1/10",
      "image": "",
      "description": "A semi-autobiographical comedy about a playwright reinventing herself as a rapper at age 40 in New York City. (R)"
    },
    {
      "title": "Miss Juneteenth (2020) - IMDb: 6.7/10",
      "image": "",
      "description": "A drama about a former beauty queen preparing her rebellious daughter for the same pageant in Fort Worth, Texas. (PG-13)"
    },
    {
      "title": "Passing (2021) - IMDb: 6.7/10",
      "image": "",
      "description": "A psychological drama about two mixed-race childhood friends navigating racial identity and societal expectations in 1920s New York. (PG-13)"
    },
    {
      "title": "The United States vs. Billie Holiday (2021) - IMDb: 6.6/10",
      "image": "",
      "description": "A biographical drama focusing on the federal government's targeting of Billie Holiday over her song 'Strange Fruit.' (R)"
    },
    {
      "title": "Sylvie's Love (2020) - IMDb: 7.0/10",
      "image": "",
      "description": "A 1950s/60s romance between an aspiring TV producer and a saxophonist, set against Harlem's jazz scene. (PG-13)"
    },
    {
      "title": "Concrete Cowboy (2020) - IMDb: 6.9/10",
      "image": "",
      "description": "A drama about Philadelphia's urban Black cowboy subculture, starring Idris Elba. (R)"
    },
    {
      "title": "Summer of Soul (2021) - IMDb: 8.0/10",
      "image": "",
      "description": "Documentary about the 1969 Harlem Cultural Festival, featuring performances by Nina Simone, Stevie Wonder, and more. (PG-13)"
    },
    {
      "title": "King Richard (2021) - IMDb: 7.5/10",
      "image": "",
      "description": "Biopic of Richard Williams, father of Venus and Serena Williams, and his relentless coaching methods. (PG-13)"
    },
    {
      "title": "Respect (2021) - IMDb: 6.6/10",
      "image": "",
      "description": "Aretha Franklin biopic tracing her journey from childhood choir singer to the Queen of Soul. (PG-13)"
    },
    {
      "title": "The Last Black Man in San Francisco (2019) - IMDb: 7.3/10",
      "image": "",
      "description": "A poetic drama about a young Black man's quest to reclaim his childhood home in a gentrified San Francisco. (R)"
    },
    {
      "title": "All Day and a Night (2020) - IMDb: 6.4/10",
      "image": "",
      "description": "A gritty drama about a young man reflecting on his life choices while serving a life sentence in the same prison as his father. (R)"
    },
    {
      "title": "The Killing Floor (1984) - IMDb: 7.4/10",
      "image": "",
      "description": "A historical drama about Black workers organizing a union in Chicago's stockyards during World War I. (NR)"
    },
    {
      "title": "A United Kingdom (2016) - IMDb: 7.0/10",
      "image": "",
      "description": "Based on the true story of Seretse Khama, a Botswanan prince, and his British wife fighting racism in 1940s Africa. (PG-13)"
    },
    {
      "title": "Loving (2016) - IMDb: 7.0/10",
      "image": "",
      "description": "A historical drama about Richard and Mildred Loving, the interracial couple whose Supreme Court case legalized mixed marriage. (PG-13)"
    },
    {
      "title": "The Watermelon Woman (1996) - IMDb: 6.9/10",
      "image": "",
      "description": "A groundbreaking indie film about a Black lesbian filmmaker researching a 1930s Black actress known only as 'The Watermelon Woman.' (NR)"
    },
    {
      "title": "Bustin' Loose (1981) - IMDb: 6.0/10",
      "image": "",
      "description": "A comedy about an ex-con forced to drive a busload of special-needs children cross-country, starring Richard Pryor. (R)"
    },
    {
      "title": "Cotton Comes to Harlem (1970) - IMDb: 6.4/10",
      "image": "",
      "description": "A blaxploitation crime film about two detectives investigating a fraudulent back-to-Africa scheme in Harlem. (GP)"
    },
    {
      "title": "Sparkle (1976) - IMDb: 6.0/10",
      "image": "",
      "description": "A musical drama about three sisters forming a singing group in 1950s Harlem, loosely inspired by The Supremes. (PG)"
    },
    {
      "title": "Top Five (2014) - IMDb: 6.6/10",
      "image": "",
      "description": "A comedy about a comedian-turned-actor reflecting on his career and love life during a day with a journalist. (R)"
    }
  ]