[
    {
      "title": "This Christmas (2007) - IMDb: 6.3/10",
      "image": "",
      "description": "A chaotic family reunion in LA brings sibling rivalries, secrets, and romance to light during the holidays. (PG-13)"
    },
    {
      "title": "The Preacher's Wife (1996) - IMDb: 5.8/10",
      "image": "",
      "description": "Denzel Washington stars as an angel helping a struggling pastor (Courtney B. Vance) and his wife (Whitney Houston) rediscover faith and love. (PG)"
    },
    {
      "title": "Almost Christmas (2016) - IMDb: 6.1/10",
      "image": "",
      "description": "A dysfunctional family gathers for their first Christmas after losing their matriarch, blending humor and healing. (PG-13)"
    },
    {
      "title": "Last Holiday (2006) - IMDb: 6.8/10",
      "image": "",
      "description": "Queen Latifah stars as a shy woman living boldly after a terminal diagnosis, culminating in a luxurious Christmas abroad. (PG-13)"
    },
    {
      "title": "A Madea Christmas (2013) - IMDb: 5.3/10",
      "image": "",
      "description": "Tyler Perry’s Madea brings chaos to a rural town’s holiday festivities while teaching lessons about family. (PG-13)"
    },
    {
      "title": "Christmas on the Square (2020) - IMDb: 5.1/10",
      "image": "",
      "description": "Dolly Parton and Christine Baranski star in this musical about a greedy woman who rediscovers kindness with angelic help. (TV-PG)"
    },
    {
      "title": "The Best Man Holiday (2013) - IMDb: 6.5/10",
      "image": "",
      "description": "College friends reunite for a Christmas weekend filled with old flames, betrayals, and emotional revelations. (R)"
    },
    {
      "title": "Holiday Heart (2000) - IMDb: 6.9/10",
      "image": "",
      "description": "Ving Rhames stars as a drag queen who shelters a recovering addict and her daughter during the holidays. (TV-PG)"
    },
    {
      "title": "A Snowy Day in Oakland (2023) - IMDb: 4.9/10",
      "image": "",
      "description": "A psychologist reconnects with her roots and finds love while opening a practice in a quirky Oakland neighborhood. (PG-13)"
    },
    {
      "title": "A Christmas in Tennessee (2022) - IMDb: 5.6/10",
      "image": "",
      "description": "A chef returns to her hometown to save a historic inn, sparking romance with a single dad during the holidays. (TV-G)"
    },
    {
      "title": "A Christmas Dance Reunion (2021) - IMDb: 5.6/10",
      "image": "",
      "description": "Former dance partners reunite at a holiday lodge, rekindling their passion for dance—and each other. (TV-G)"
    },
    {
      "title": "A Nashville Christmas Carol (2020) - IMDb: 5.7/10",
      "image": "",
      "description": "A modern twist on Dickens’ classic, starring a selfish songwriter visited by ghosts to rediscover holiday spirit. (TV-G)"
    },
    {
      "title": "Jingle Jangle: A Christmas Journey (2020) - IMDb: 6.6/10",
      "image": "",
      "description": "A magical musical about a toymaker (Forest Whitaker) and his granddaughter reigniting wonder in a steampunk-inspired world. (PG)"
    },
    {
      "title": "A Holiday in Harlem (2023) - IMDb: 5.8/10",
      "image": "",
      "description": "A music manager returns home to Harlem, falling for a community organizer while saving a historic theater. (TV-PG)"
    },
    {
      "title": "Dear Santa (2020) - IMDb: 6.1/10",
      "image": "",
      "description": "A spoiled heiress finds purpose by answering children’s letters to Santa, leading to unexpected love. (TV-G)"
    },
    {
      "title": "A Christmas Princess (2019) - IMDb: 5.3/10",
      "image": "",
      "description": "A Brooklyn waitress discovers royal roots and navigates a whirlwind romance during a snowy European Christmas. (TV-G)"
    },
    {
      "title": "The Holiday Calendar (2018) - IMDb: 5.8/10",
      "image": "",
      "description": "A magical advent calendar predicts the future for a photographer (Kat Graham) torn between love and ambition. (TV-PG)"
    },
    {
      "title": "A Christmas Wish (2023) - IMDb: 5.5/10",
      "image": "",
      "description": "A struggling single mom wins a lottery ticket but learns true wealth lies in family and community. (TV-PG)"
    },
    {
      "title": "A Christmas Blessing (2023) - IMDb: 5.9/10",
      "image": "",
      "description": "A doctor returns to her hometown, clashing with a charming contractor while reviving a holiday tradition. (TV-G)"
    },
    {
      "title": "A New Orleans Christmas (2023) - IMDb: 5.7/10",
      "image": "",
      "description": "A chef partners with a jazz musician to host a festive fundraiser, blending Creole flavors and holiday romance. (TV-PG)"
    }
  ]