
[
  {
    "title": "A Soldier's Story (1984) - IMDb: 7.2/10",
    "image": "",
    "description": "A military investigator probes the murder of a Black sergeant in 1944 Louisiana, uncovering racial tensions within the unit. (PG)"
  },
  {
    "title": "The Five Heartbeats (1991) - IMDb: 7.4/10",
    "image": "",
    "description": "Robert Townsend's musical drama about a 1960s R&B group navigating fame, brotherhood, and industry exploitation. (R)"
  },
  {
    "title": "Hoop Dreams (1994) - IMDb: 8.3/10",
    "image": "",
    "description": "A landmark documentary following two Chicago teens striving to become NBA stars amid socioeconomic challenges. (PG-13)"
  },
  {
    "title": "Fresh (1994) - IMDb: 7.6/10",
    "image": "",
    "description": "A 12-year-old drug runner uses his chess skills to outmaneuver dealers and save his family in this gritty crime drama. (R)"
  },
  {
    "title": "Jason's Lyric (1994) - IMDb: 6.8/10",
    "image": "",
    "description": "A romantic drama about two brothers in Houston grappling with trauma, love, and redemption. (R)"
  },
  {
    "title": "Dead Presidents (1995) - IMDb: 6.6/10",
    "image": "",
    "description": "A Vietnam War veteran turns to heists to rebuild his life in this crime drama steeped in 1970s Black culture. (R)"
  },
  {
    "title": "Set It Off (1996) - IMDb: 7.2/10",
    "image": "",
    "description": "Four Black women from Los Angeles turn to bank robbery to escape systemic oppression. (R)"
  },
  {
    "title": "Soul Food (1997) - IMDb: 6.9/10",
    "image": "",
    "description": "A family drama centered on Sunday dinners that bind three sisters and their loved ones through joy and conflict. (R)"
  },
  {
    "title": "Love Jones (1997) - IMDb: 7.3/10",
    "image": "",
    "description": "A Chicago poet and photographer navigate love, art, and miscommunication in this iconic Black romance. (R)"
  },
  {
    "title": "Down in the Delta (1998) - IMDb: 6.9/10",
    "image": "",
    "description": "Maya Angelou directs this story of a struggling mother finding purpose in her family’s Mississippi roots. (PG-13)"
  },
  {
    "title": "Antwone Fisher (2002) - IMDb: 7.3/10",
    "image": "",
    "description": "Denzel Washington directs this true story of a Navy sailor confronting childhood trauma through therapy. (PG-13)"
  },
  {
    "title": "Talk to Me (2007) - IMDb: 7.1/10",
    "image": "",
    "description": "A biographical drama about DC radio personality Petey Greene’s influence during the 1960s civil rights era. (R)"
  },
  {
    "title": "The Princess and the Frog (2009) - IMDb: 7.1/10",
    "image": "",
    "description": "Disney’s animated musical featuring Tiana, the first Black princess, pursuing her New Orleans restaurant dream. (G)"
  },
  {
    "title": "Night Catches Us (2010) - IMDb: 6.1/10",
    "image": "",
    "description": "A 1976 Philadelphia-set drama about former Black Panthers reconciling past activism with present struggles. (R)"
  },
  {
    "title": "Southside with You (2016) - IMDb: 6.5/10",
    "image": "",
    "description": "A romantic drama chronicling Barack and Michelle Obama’s first date in 1989 Chicago. (PG-13)"
  },
  {
    "title": "Straight Outta Compton (2015) - IMDb: 7.8/10",
    "image": "",
    "description": "Biopic of N.W.A’s rise, highlighting Ice Cube, Dr. Dre, and Eazy-E’s impact on hip-hop and police brutality protests. (R)"
  },
  {
    "title": "Detroit (2017) - IMDb: 7.3/10",
    "image": "",
    "description": "Kathryn Bigelow’s harrowing account of the 1967 Algiers Motel incident during Detroit’s racial uprising. (R)"
  },
  {
    "title": "Roman J. Israel, Esq. (2017) - IMDb: 6.3/10",
    "image": "",
    "description": "Denzel Washington stars as an idealistic lawyer navigating moral compromises in LA’s criminal justice system. (PG-13)"
  },
  {
    "title": "Blindspotting (2018) - IMDb: 7.4/10",
    "image": "",
    "description": "A Oakland ex-con’s life unravels after witnessing a police shooting in this darkly comedic social commentary. (R)"
  },
  {
    "title": "Bessie (2015) - IMDb: 6.7/10",
    "image": "",
    "description": "Queen Latifah stars as blues legend Bessie Smith in this HBO biopic about her career and personal struggles. (TV-MA)"
  }
]